'''
Задана строка из стихотворения: «Мой дядя самых честных правил,
Когда не в шутку занемог, Он уважать себя заставил И лучше
выдумать не мог»
Удалите из строки все слова, начинающиеся на букву «м». Результат вывести на экран в
виде строки.
Подсказка: вспомните про модификацию списков.
'''

'''
Дан произвольный текст. Найдите номер первого самого длинного слова в нем.
'''

'''
Дан произвольный текст. Напечатайте все имеющиеся в нем цифры, определите их
количество, сумму и найти максимальное.
'''

'''
Упражнение 12.10
Создайте матрицу (список из вложенных списков) размера N x M (фиксируются в
программе), заполненную случайными целыми числами.
'''

'''
Упражнение 12.11
Создайте матрицу (список из вложенных списков) размера N x N (фиксируются в
программе), заполненную случайными целыми числами.
'''

'''
Упражнение 12.12
Дана матрица (см. упражнение 12.10). Вывести номер строки, содержащей
максимальное число одинаковых элементов.
'''

'''
Упражнение 12.13
Дана целочисленная квадратная матрица (см. упражнение 12.11). Найти
произведение элементов матрицы, лежащих ниже главной диагонали.
'''

'''
Упражнение 12.14
Дана целочисленная квадратная матрица (см. упражнение 12.11). Найти сумму
элементов матрицы, лежащих выше главной диагонали.
'''

'''
Упражнение 16.1
Напишите функцию, которая возвращает разность между наибольшим и наименьшим
значениями из списка целых случайных чисел.
'''

'''
Упражнение 16.2
Напишите программу, которая для целочисленного списка из 1000 случайных
элементов определяет, сколько отрицательных элементов располагается между его
максимальным и минимальным элементами.
В упражнениях 16.3-8 список состоит из случайных элементов, в списке не менее
1000 элементов.
'''

'''
Упражнение 16.3
Найти элемент, наиболее близкий к среднему значению всех элементов списка.
'''

'''
Упражнение 16.4
Дан список, состоящий из чисел. Найти сумму простых чисел в списке.
Упражнение 16.5
Дан список целых чисел. Определить, есть ли в нем хотя бы одна пара соседних
нечетных чисел. В случае положительного ответа определить номера элементов первой из
таких пар.
Упражнение 16.6
Дан список целых чисел. Определить количество четных элементов и количество
элементов, оканчивающихся на цифру 5.
Упражнение 16.7
Задан список из целых чисел. Определить процентное содержание элементов,
превышающих среднеарифметическое всех элементов списка.
Упражнение 16.8
Задан список из целых чисел. Определить количество участков списка, на котором
элементы монотонно возрастают (каждое следующее число больше предыдущего).
Упражнение 16.9
Дан список из 20 элементов. Найти пять соседних элементов, сумма значений
которых максимальна.
'''